#!/bin/bash
###################################################################
#Name		:Islam
#Version	:Linux 6.5.0-25-generic Ubunta 22.04 LTS
#Description	:Edited TCP configuration
#Email		:gashimov.islam@bk.ru
#Program version: v1.0.0
###################################################################


#Увеличение длины очереди входящих пакетов
#После получения пакетов из кольцевого буфера сетевой карты они помещаются в специальную очередь в ядре.
#При использовании высокоскоростных сетевых карт увеличение размера очереди может помочь предотвратить потерю пакетов: 
sysctl net.core.netdev_max_backlog=16384

#Увеличение максимального числа ожидающих соединений
#Максимальное число входящих соединений, ожидающих приёма (accept) программой, на одном сокете:
sysctl net.core.somaxconn=8192

#Включение TCP Fast Open
#помогает уменьшить задержки в сети, позволяя начать передачу данных сразу при отправке клиентом первого TCP SYN
sysctl net.ipv4.tcp_fastopen=3

#tcp_max_syn_backlog задаёт максимальную длину очереди соединений 
sysctl net.ipv4.tcp_max_syn_backlog=8192

#tcp_max_tw_buckets — максимальное число сокетов в состоянии TIME_WAIT.
#После достижения этого числа система начнёт уничтожать сокеты, находящиеся в этом состоянии.
#Увеличение этого значения может помочь от простых DoS-атак: 
sysctl net.ipv4.tcp_max_tw_buckets=2000000

#Указывает, сколько секунд нужно ждать последнего FIN-пакета, прежде чем сокет будет принудительно закрыт
sysctl net.ipv4.tcp_fin_timeout=10

#Отключение этой опции приведёт к тому, что размер окна по умолчанию будет применяться только для новых соединений, что может улучшить производительность долгоживущих соединений: 
sysctl net.ipv4.tcp_slow_start_after_idle=0

#Если другая сторона не отвечает, сокет автоматически закрываетс after 120s
sysctl net.ipv4.tcp_keepalive_time=60 net.ipv4.tcp_keepalive_intvl=10 net.ipv4.tcp_keepalive_probes=6

#Отключение генерации временных меток в TCP-пакетах уменьшит пики и может дать прирост производительности в гигабитных сетях:
sysctl net.ipv4.tcp_timestamps=0

#Алгоритм управления перегрузками BBR может помочь достичь более высокой пропускной способности и более низких задержек для интернет-трафика
modprobe tcp_bbr
sysctl net.core.default_qdisc=cake net.ipv4.tcp_congestion_control=bbr

#Максимальный размер буфера TCP
sysctl net.core.rmem_max=16777216
sysctl net.core.wmem_max=16777216
